docs/successful_dev_test_docs/working_full_request.txt

POST https://labsdev.netsmartcloud.com:444/CareConnectXDR HTTP/1.1
Accept-Encoding: gzip,deflate
Content-Type: multipart/related; type="application/xop+xml"; start="<rootpart@soapui.org>"; start-info="application/soap+xml"; action="urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b"; boundary="----=_Part_0_581382233.1586371463133"
MIME-Version: 1.0
Content-Length: 8336
Host: labsdev.netsmartcloud.com:444
Connection: Keep-Alive
User-Agent: Apache-HttpClient/4.1.1 (java 1.5)


------=_Part_0_581382233.1586371463133
Content-Type: application/xop+xml; charset=UTF-8; type="application/soap+xml"; action="DocumentRepository_ProvideAndRegisterDocumentSet-b"
Content-Transfer-Encoding: 8bit
Content-ID: <rootpart@soapui.org>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:urn="urn:ihe:iti:xds-b:2007" xmlns:urn1="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:urn2="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:urn3="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:direct="urn:direct:addressing">
   <soap:Header>
      <a:MessageID>123456789</a:MessageID>
      <a:Action soap:mustUnderstand="1">urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</a:Action>
      <direct:addressBlock a:IsReferenceParameter="true" a:relay="true" a:role="urn:direct:addressing:destination">
         <direct:from>tampa211@211.com</direct:from>
         <direct:to>OperationPar@uat.direct.ntst.com</direct:to>
         <direct:metadata-level>XDS</direct:metadata-level>
      </direct:addressBlock>
   </soap:Header>
   <soap:Body>
      <urn:ProvideAndRegisterDocumentSetRequest>
         <urn1:SubmitObjectsRequest id="123">
            <!--Optional:-->
            <urn3:RegistryObjectList>
               <!--Zero or more repetitions:-->
               <urn3:Identifiable id="456">
                  <!--Zero or more repetitions:-->
                  <urn3:Slot name="creationTime">
                     <urn3:ValueList>
                        <urn3:Value>1980-03-23T10:20:15</urn3:Value>
                     </urn3:ValueList>
                  </urn3:Slot>
                  <urn3:Slot name="languageCode">
                     <urn3:ValueList>
                        <urn3:Value>en-US</urn3:Value>
                     </urn3:ValueList>
                  </urn3:Slot>
               </urn3:Identifiable>
            </urn3:RegistryObjectList>
         </urn1:SubmitObjectsRequest>
         <!--1 or more repetitions of Document-->
         <Document id="ed13ffc6-f11d-4925-9eda-714c5a9ab847">
            <xop:Include href="cid:CCD.xml" xmlns:xop="http://www.w3.org/2004/08/xop/include"/>
         </Document>
      </urn:ProvideAndRegisterDocumentSetRequest>
   </soap:Body>
</soap:Envelope>
------=_Part_0_581382233.1586371463133
Content-Type: text/xml; charset=us-ascii; name=CCD.xml
Content-Transfer-Encoding: 7bit
Content-ID: <CCD.xml>
Content-Disposition: attachment; name="CCD.xml"; filename="CCD.xml"

<ClinicalDocument xmlns:voc="urn:hl7-org:v3/voc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="urn:hl7-org:v3" xsi:schemaLocation="urn:hl7-org:v3 infrastructure/cda/CDA.xsd">
  <typeId extension="POCD_HD000040" root="2.16.840.1.113883.1.3"/>
  <templateId root="2.16.840.1.113883.10.20.1"/>
  <id extension="2064" root="db734647-fc99-424c-a864-7e3cda82e703"/>
  <code code="34133-9" codeSystem="2.16.840.1.113883.6.1" displayName="Summarization of episode note"/>
  <title>2-1-1 Tampa Bay Cares Continuity of Care Document</title>
  <effectiveTime value="20170624185618"/>
  <confidentialityCode code="Y" codeSystem="2.16.840.1.113883.5.25"/>
  <languageCode code="en-US"/>
  <recordTarget>
    <patientRole>
      <id extension="119566" root="2.16.840.1.113883.19.5"/>
      <telecom value="tel:7273698018"/>
      <patient>
        <name>
          <given>TestFirstName</given>
          <family>TestLastName</family>
        </name>
        <administrativeGenderCode code="M" displayName="Male" codeSystem="2.16.840.1.113883.5.1" codeSystemName="AdministrativeGenderCode"/>
        <birthTime value="19670326000000"/>
        <ethnicGroupCode codeSystem="2.16.840.1.113883.5.50" codeSystemName="Race and Ethnicity Code Sets"/>
      </patient>
      <providerOrganization>
        <id root="2.16.840.1.113883.19.5" extension="003"/>
        <name>ServicePoint-CallPoint</name>
      </providerOrganization>
    </patientRole>
  </recordTarget>
  <author>
    <time value="20000407130000+0500"/>
    <assignedAuthor>
      <id root="20cf14fb-b65c-4c8c-a54d-b0cca834c18c"/>
      <assignedPerson>
        <name>
          <given>Edward</given>
          <family>Perry</family>
        </name>
      </assignedPerson>
      <representedOrganization>
        <id root="2.16.840.1.113883.19.5"/>
        <name>2-1-1 Tampa Bay Cares</name>
      </representedOrganization>
    </assignedAuthor>
  </author>
  <custodian>
    <assignedCustodian>
      <representedCustodianOrganization>
        <id root="2.16.840.1.113883.19.5"/>
        <name>2-1-1 Tampa Bay Cares</name>
      </representedCustodianOrganization>
    </assignedCustodian>
  </custodian>
  <legalAuthenticator>
    <time value="20111223130000+0500"/>
    <signatureCode code="S"/>
    <assignedEntity>
      <id nullFlavor="NI"/>
      <assignedPerson>
        <name>Edward Perry</name>
      </assignedPerson>
      <representedOrganization>
        <id root="2.16.840.1.113883.19.5" extension="11"/>
        <name>2-1-1 Tampa Bay Cares</name>
      </representedOrganization>
    </assignedEntity>
  </legalAuthenticator>
  <documentationOf>
    <serviceEvent classCode="PCPR">
      <effectiveTime>
        <low value="20170624000000"/>
        <high value="20000407"/>
      </effectiveTime>
      <performer typeCode="PRF">
        <functionCode code="PCP" codeSystem="2.16.840.1.113883.5.88"/>
        <assignedEntity>
          <id extension="8712" root="20cf14fb-b65c-4c8c-a54d-b0cca834c18c"/>
          <assignedPerson>
            <name>
              <given>Edward</given>
              <family>Perry</family>
            </name>
          </assignedPerson>
          <representedOrganization>
            <id root="2.16.840.1.113883.19.5" extension="003"/>
            <name>ServicePoint-CallPoint</name>
          </representedOrganization>
        </assignedEntity>
      </performer>
    </serviceEvent>
  </documentationOf>
  <component>
    <structuredBody>
      <component>
        <section>
          <templateId root="2.16.840.1.113883.10.20.1.13"/>
          <code code="48764-5" codeSystem="2.16.840.1.113883.6.1"/>
          <title>Referral for client services from 2-1-1 Tampa Bay Cares</title>
          <ex:Referrals xmlns:airs="http://www.hudhdx.info/Resources/Vendors/3_0/AIRS_3_0_mod.xsd" xmlns:ex="https://raw.githubusercontent.com/211tbc/synthesis/master/src/xsd/TBC_Extend_HUD_HMIS.xsd" xmlns:hmis="http://www.hudhdx.info/Resources/Vendors/3_0/HUD_HMIS.xsd">
            <ex:Referral>
              <ex:ReferralID>
                <hmis:IDNum>2879694</hmis:IDNum>
              </ex:ReferralID>
              <hmis:Taxonomy>
                <airs:Code>BH-3800.7000 Rent Payment Assistance</airs:Code>
              </hmis:Taxonomy>
              <ex:ServiceEventNotes>
                <hmis:note>
                  <hmis:NoteID>
                    <hmis:IDNum>852583</hmis:IDNum>
                  </hmis:NoteID>
                  <hmis:NoteText hmis:dateCollected="20170624184210" hmis:dateEffective="20170624184210">6-24-17 MW  can't concentrate.  paranoia and anxiety.</hmis:NoteText>
                </hmis:note>
              </ex:ServiceEventNotes>
            </ex:Referral>
          </ex:Referrals>
          <ns0:TempServiceEvent xmlns:ns0="https://raw.githubusercontent.com/211tbc/synthesis/master/src/xsd/TBC_Extend_HUD_HMIS.xsd">
            <ns0:TempAirsCode/>
          </ns0:TempServiceEvent>
          <entry typeCode="DRIV">
            <act classCode="ACT" moodCode="RQO">
              <templateId root="2.16.840.1.113883.10.20.1.30"/>
              <code code="23745001" codeSystem="2.16.840.1.113883.6.96" displayName="Documentation procedure"/>
              <statusCode code="completed"/>
              <entryRelationship typeCode="RSON">
                <act classCode="ACT" moodCode="EVN">
                  <code code="308292007" codeSystem="2.16.840.1.113883.6.96" displayName="Transfer of care"/>
                  <statusCode code="completed"/>
                </act>
              </entryRelationship>
            </act>
          </entry>
          <entry>
            <encounter classCode="ACT" moodCode="EVN"/>
          </entry>
        </section>
      </component>
    </structuredBody>
  </component>
</ClinicalDocument>

------=_Part_0_581382233.1586371463133--

